app/controllers/vehicles_controller.rb

SELECT * FROM `vehicles` WHERE (`vehicles`.`id` = 1)
---
  def show
    @vehicle = Vehicle.find(params[:id])

SELECT * FROM `vehicles` WHERE (`vehicles`.`id` = 1)
---
  def edit
    @vehicle = Vehicle.find(params[:id])

INSERT INTO `vehicles` (`seat_count`, `created_at`, `updated_at`, `metadata`, `color`, `type`) VALUES(2, '2010-05-09 20:36:00', '2010-05-09 20:36:00', '--- !map:HashWithIndifferentAccess \nprice: \"12000\"\ngas_mileage: !map:HashWithIndifferentAccess \n city: \"15\"\n highway: \"20\"\n', 'Black', 'Truck')
---
  def create
    @vehicle = Vehicle.new(params[:vehicle])

    respond_to do |format|
      if @vehicle.save

SELECT * FROM `vehicles` WHERE (`vehicles`.`id` = 1)
UPDATE `vehicles` SET `updated_at` = '2010-05-09 20:58:52', `metadata` = '<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<hash>\n <sticker-information>\n <price>12000</price>\n <gas-mileage>\n <city>30</city>\n <highway>20</highway>\n </gas-mileage>\n </sticker-information>\n</hash>\n' WHERE `id` = 1
---
  def update
    @vehicle = Vehicle.find(params[:id])

    respond_to do |format|
      if @vehicle.update_attributes(params[:vehicle])

SELECT * FROM `vehicles` WHERE (`vehicles`.`id` = 1)
DELETE FROM `vehicles` WHERE `id` = 1
---
  def destroy
    @vehicle = Vehicle.find(params[:id])
    @vehicle.destroy